### AI-04 quiz

#### Import libraries

In [47]:
import numpy as np
import pandas as pd

#### Parameters

In [48]:
csv_in = '../ai-03/running.csv'

In [49]:
df = pd.read_csv(csv_in, delimiter=',', skiprows=0, header=0)
print(df.shape)
print(df.info())
display(df.head())

(50, 4)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 4 columns):
ID       50 non-null int64
Univ     48 non-null object
Grade    50 non-null int64
Time     49 non-null float64
dtypes: float64(1), int64(2), object(1)
memory usage: 1.6+ KB
None

     ID Univ  Grade    Time
0  1001    D      3  1870.0
1  1002  NaN      2  1937.0
2  1003  NaN      1  2036.0
3  1004    C      1  1957.0
4  1005    D      1     NaN

#### Drop rows with missing value

In [50]:
#df2 = df.dropna(axis=0)
df2 = df.dropna(axis=0).reset_index(drop=True)
print(df2.shape)
print(df2.info())
display(df2.head())

(47, 4)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 47 entries, 0 to 46
Data columns (total 4 columns):
ID       47 non-null int64
Univ     47 non-null object
Grade    47 non-null int64
Time     47 non-null float64
dtypes: float64(1), int64(2), object(1)
memory usage: 1.5+ KB
None

     ID Univ  Grade    Time
0  1001    D      3  1870.0
1  1004    C      1  1957.0
2  1006    D      2  2063.0
3  1007    D      3  1839.0
4  1008    C      2  1740.0

#### Cross table

In [51]:
ct = pd.crosstab(df2['Univ'], df2['Grade'], margins=True)
display(ct)

Grade   1   2   3   4  All
Univ
A       3   4   5   4   16
B       2   1   2   3    8
C       1   3   1   3    8
D       5   3   6   1   15
All    11  11  14  11   47

#### Obtain sum (groupby)

In [52]:
df_gr = df2.groupby('Univ').mean()
#display(df_gr)
print(df_gr['Time'])

Univ
A    1918.375000
B    1936.375000
C    1930.250000
D    1886.466667
Name: Time, dtype: float64

#### Obtain sum (groupby2)

In [53]:
df_gr = df2.groupby('Univ').mean()['Time']
display(df_gr)

Univ
A    1918.375000
B    1936.375000
C    1930.250000
D    1886.466667
Name: Time, dtype: float64

#### Obtain sum (pivot_table)

In [54]:
pv = pd.pivot_table(df2, index='Univ', columns='Grade', values='Time', aggfunc=np.mean)
display(pv)

Grade            1            2            3            4
Univ
A      1980.666667  1970.750000  1835.200000  1923.250000
B      1860.500000  1974.000000  2067.000000  1887.333333
C      1957.000000  1881.666667  1937.000000  1967.666667
D      1874.600000  1957.000000  1854.833333  1924.000000

In [55]:
#?pd.pivot_table